Revit 2016 API
IPipeFittingAndAccessoryPressureDropUIServer Interface
 Interface for external servers providing optional UI for pipe fitting and pipe accessory coefficient calculation.
Namespace: Autodesk.Revit.UI.Plumbing
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2014
Syntax
C#
public interface IPipeFittingAndAccessoryPressureDropUIServer : IExternalServer
Visual Basic
Public Interface IPipeFittingAndAccessoryPressureDropUIServer _
	Inherits IExternalServer
Visual C++
public interface class IPipeFittingAndAccessoryPressureDropUIServer : IExternalServer
See Also
IPipeFittingAndAccessoryPressureDropUIServer Members
Autodesk.Revit.UI.Plumbing Namespace